OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t0xx.h
/**
  ******************************************************************************
  * @file    py32t0xx.h
  * @brief   CMSIS PY32T0xx Device Peripheral Access Layer Header File.
  * @version v1.0.0
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/** @addtogroup py32t0xx
  * @{
  */
#ifndef __PY32T0XX_H
#define __PY32T0XX_H

/**
  * @brief PY32T0 Family
  */
#if !defined (PY32T0)
#define PY32T0
#endif /* PY32T0 */

/**  Uncomment the line below according to the target PY32 device used in your
  *  application.
  */

#if !defined (PY32T020x6) && !defined (PY32T020x5) && !defined (PY32T020Bx6) && !defined (PY32T020Bx5) &&\
    !defined (PY32T092xC) && !defined (PY32T090xB)
/* #define PY32T020x6  */  /*!< PY32T020x6  Devices (PY32T020x6  microcontrollers where the Flash memory is 32  Kbytes) */
/* #define PY32T020x5  */  /*!< PY32T020x5  Devices (PY32T020x5  microcontrollers where the Flash memory is 20  Kbytes) */
/* #define PY32T020Bx6 */  /*!< PY32T020Bx6 Devices (PY32T020Bx6 microcontrollers where the Flash memory is 32  Kbytes) */
/* #define PY32T020Bx5 */  /*!< PY32T020Bx5 Devices (PY32T020Bx5 microcontrollers where the Flash memory is 20  Kbytes) */
/* #define PY32T092xC  */  /*!< PY32T092xC  Devices (PY32T092xC  microcontrollers where the Flash memory is 256 Kbytes) */
/* #define PY32T090xB  */  /*!< PY32T090xB  Devices (PY32T090xB  microcontrollers where the Flash memory is 128 Kbytes) */
#endif
/**  Tip: To avoid modifying this file each time you need to switch between these
  *       devices, you can define the device in your toolchain compiler preprocessor.
  */
#if (defined(PY32T020x6) || defined(PY32T020x5))
#define PY32T020PRE
#elif (defined(PY32T020Bx6)|| defined(PY32T020Bx5))
#define PY32T020BPRE
#elif (defined(PY32T092xC))
#define PY32T092PRE
#elif (defined(PY32T090xB))
#define PY32T090PRE
#endif

/**
  * @brief CMSIS Device version number V1.0.0
  */
#define __PY32T0_DEVICE_VERSION_MAIN   (0x01) /*!< [31:24] main version */
#define __PY32T0_DEVICE_VERSION_SUB1   (0x00) /*!< [23:16] sub1 version */
#define __PY32T0_DEVICE_VERSION_SUB2   (0x00) /*!< [15:8]  sub2 version */
#define __PY32T0_DEVICE_VERSION_RC     (0x00) /*!< [7:0]  release candidate */
#define __PY32T0_DEVICE_VERSION        ((__PY32T0_DEVICE_VERSION_MAIN << 24)\
                                        |(__PY32T0_DEVICE_VERSION_SUB1 << 16)\
                                        |(__PY32T0_DEVICE_VERSION_SUB2 << 8 )\
                                        |(__PY32T0_DEVICE_VERSION_RC))

/**
  * @brief Device_Included
  */
#if defined(PY32T020Bx6)
#include "py32t020bx6.h"
#elif defined(PY32T020Bx5)
#include "py32t020bx5.h"
#elif defined(PY32T020x5)
#include "py32t020x5.h"
#elif defined(PY32T020x6)
#include "py32t020x6.h"
#elif defined(PY32T092xC)
#include "py32t092xC.h"
#elif defined(PY32T090xB)
#include "py32t090xB.h"
#else
#error "Please select first the target PY32T0xx device used in your application (in py32t0xx.h file)"
#endif /* Device_Included */

/**
  * @brief Exported_types
  */
typedef enum
{
  RESET = 0,
  SET = !RESET
} FlagStatus, ITStatus;

typedef enum
{
  DISABLE = 0,
  ENABLE = !DISABLE
} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum 
{
  SUCCESS = 0U,
  ERROR = !SUCCESS
} ErrorStatus;

/**
  * @brief Exported_macros
  */
#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

#define READ_BIT(REG, BIT)    ((REG) & (BIT))

#define CLEAR_REG(REG)        ((REG) = (0x0))

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))

#define READ_REG(REG)         ((REG))

#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))

#define POSITION_VAL(VAL)     (__CLZ(__RBIT(VAL)))

/* Use of interrupt control for register exclusive access */
/* Atomic 32-bit register access macro to set one or several bits */
#define ATOMIC_SET_BIT(REG, BIT)                             \
  do {                                                       \
    uint32_t primask;                                        \
    primask = __get_PRIMASK();                               \
    __set_PRIMASK(1);                                        \
    SET_BIT((REG), (BIT));                                   \
    __set_PRIMASK(primask);                                  \
  } while(0)

/* Atomic 32-bit register access macro to clear one or several bits */
#define ATOMIC_CLEAR_BIT(REG, BIT)                           \
  do {                                                       \
    uint32_t primask;                                        \
    primask = __get_PRIMASK();                               \
    __set_PRIMASK(1);                                        \
    CLEAR_BIT((REG), (BIT));                                 \
    __set_PRIMASK(primask);                                  \
  } while(0)

/* Atomic 32-bit register access macro to clear and set one or several bits */
#define ATOMIC_MODIFY_REG(REG, CLEARMSK, SETMASK)            \
  do {                                                       \
    uint32_t primask;                                        \
    primask = __get_PRIMASK();                               \
    __set_PRIMASK(1);                                        \
    MODIFY_REG((REG), (CLEARMSK), (SETMASK));                \
    __set_PRIMASK(primask);                                  \
  } while(0)

/* Atomic 16-bit register access macro to set one or several bits */
#define ATOMIC_SETH_BIT(REG, BIT) ATOMIC_SET_BIT(REG, BIT)                                   \

/* Atomic 16-bit register access macro to clear one or several bits */
#define ATOMIC_CLEARH_BIT(REG, BIT) ATOMIC_CLEAR_BIT(REG, BIT)                               \

/* Atomic 16-bit register access macro to clear and set one or several bits */
#define ATOMIC_MODIFYH_REG(REG, CLEARMSK, SETMASK) ATOMIC_MODIFY_REG(REG, CLEARMSK, SETMASK) \

#define HW32_REG(ADDRESS)     ( * ((volatile unsigned           int * )(ADDRESS)))

#define HW16_REG(ADDRESS)     ( * ((volatile unsigned short     int * )(ADDRESS)))

#define HW8_REG(ADDRESS)      ( * ((volatile unsigned          char * )(ADDRESS)))

#define M32(ADDRESS)          HW32_REG(ADDRESS)

#define M16(ADDRESS)          HW16_REG(ADDRESS)

#define M8(ADDRESS)           HW8_REG(ADDRESS)

/**
  * @}
  */

/**
  * @brief Comment the line below if you will not use the peripherals drivers.
  *        In this case, these drivers will not be included and the application code will
  *        be based on direct access to peripherals registers
  */
#if !defined  (USE_HAL_DRIVER)
/*#define USE_HAL_DRIVER */
#endif /* USE_HAL_DRIVER */

#if defined (USE_HAL_DRIVER)
#include "py32t0xx_hal.h"
#endif /* USE_HAL_DRIVER */

#endif /* __PY32T0xx_H */

#ifdef __cplusplus
}
#endif /* __cplusplus */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/

